{
    "title": "SECOND VARIETY",

"author": "PHILIP K. DICK",
"story": "The claws were bad enough in the first place—nasty, crawling little death-robots. But when they began to imitate their creators, it was time for the human race to make peace—if it could!\nThe Russian soldier made his way nervously up the ragged side of the hill, holding his gun ready. He glanced around him, licking his dry lips, his face set. From time to time he reached up a gloved hand and wiped perspiration from his neck, pushing down his coat collar.\nEric turned to Corporal Leone. “Want him? Or can I have him?” He adjusted the view sight so the Russian’s features squarely filled the glass, the lines cutting across his hard, somber features.\nLeone considered. The Russian was close, moving rapidly, almost running. “Don’t fire. Wait.” Leone tensed. “I don’t think we’re needed.”\nThe Russian increased his pace, kicking ash and piles of debris out of his way. He reached the top of the hill and stopped, panting, staring around him. The sky was overcast, drifting clouds of gray particles. Bare trunks of trees jutted up occasionally; the ground was level and bare, rubble-strewn, with the ruins of buildings standing out here and there like yellowing skulls.\nThe Russian was uneasy. He knew something was wrong. He started down the hill. Now he was only a few paces from the bunker. Eric was getting fidgety. He played with his pistol, glancing at Leone.\n“Don’t worry,” Leone said. “He won’t get here. They’ll take care of him.”\n“Are you sure? He’s got damn far.”\n“They hang around close to the bunker. He’s getting into the bad part. Get set!”\nThe Russian began to hurry, sliding down the hill, his boots sinking into the heaps of gray ash, trying to keep his gun up. He stopped for a moment, lifting his fieldglasses to his face.\n“He’s looking right at us,” Eric said.\nThe Russian came on. They could see his eyes, like two blue stones. His mouth was open a little. He needed a shave; his chin was stubbled. On one bony cheek was a square of tape, showing blue at the edge. A fungoid spot. His coat was muddy and torn. One glove was missing. As he ran his belt counter bounced up and down against him.\nLeone touched Eric’s arm. “Here one comes.”\nAcross the ground something small and metallic came, flashing in the dull sunlight of mid-day. A metal sphere. It raced up the hill after the Russian, its treads flying. It was small, one of the baby ones. Its claws were out, two razor projections spinning in a blur of white steel. The Russian heard it. He turned instantly, firing. The sphere dissolved into particles. But already a second had emerged and was following the first. The Russian fired again.\nA third sphere leaped up the Russian’s leg, clicking and whirring. It jumped to the shoulder. The spinning blades disappeared into the Russian’s throat.\nEric relaxed. “Well, that’s that. God, those damn things give me the creeps. Sometimes I think we were better off before.”\n“If we hadn’t invented them, they would have.” Leone lit a cigarette shakily. “I wonder why a Russian would come all this way alone. I didn’t see anyone covering him.”\nLt. Scott came slipping up the tunnel, into the bunker. “What happened? Something entered the screen.”\n“An Ivan.”\n“Just one?”\nEric brought the view screen around. Scott peered into it. Now there were numerous metal spheres crawling over the prostrate body, dull metal globes clicking and whirring, sawing up the Russian into small parts to be carried away.\n“What a lot of claws,” Scott murmured.\n“They come like flies. Not much game for them any more.”\nScott pushed the sight away, disgusted. “Like flies. I wonder why he was out there. They know we have claws all around.”\nA larger robot had joined the smaller spheres. It was directing operations, a long blunt tube with projecting eyepieces. There was not much left of the soldier. What remained was being brought down the hillside by the host of claws.\n“Sir,” Leone said. “If it’s all right, I’d like to go out there and take a look at him.”\n“Why?”\n“Maybe he came with something.”\nScott considered. He shrugged. “All right. But be careful.”\n“I have my tab.” Leone patted the metal band at his wrist. “I’ll be out of bounds.”"
}